twtomato/mimiclaw-lcd/sdkconfig.defaults.esp32c6
# MimiClaw - ESP32-C6 (XIAO Seeed Studio) Target Configuration
CONFIG_IDF_TARGET="esp32c6"

# Flash 4MB + QIO
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU 160MHz (C6 maximum)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# WiFi memory optimization
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

# TLS optimization (internal RAM only, no PSRAM)
# Dynamic buffer: allocate SSL in/out buffers only when in use, free after
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# Custom partition table (4MB layout)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_c6.csv"

# Console: USB Serial/JTAG (XIAO C6 USB-C port)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# No display
CONFIG_MIMI_DISPLAY_NONE=y
